package com.gmail.pazuzu.enums;

public enum Regex
{
    ONLY_20_LETTERS("^([a-zA-Z]|[а-яА-Я]){1,20}$"),
    NOTING_OR_20_LETTERS("(^$)|(^([a-zA-Z]|[а-яА-Я]){1,20}$)"),
    SEX("(^$)|(^m$)|(^f$)"),
    BIRTHDAY("^(?:31(-)(?:0?[13578]|1[02])\\1|(?:29|30)(-)(?:" + "0?[1,3-9]|1[0-2])\\2)(?:1[6-9]|[2-9]\\d)?\\d{2}$|^29(-)0?2" + "\\3(?:(?:1[6-9]|[2-9]\\d)?(?:0[48]|[2468][048]|[13579][26])|(?:16|" + "[2468][048]|[3579][26])00)$|^(?:0?[1-9]|1\\d|2[0-8])(-)" + "(?:0?[1-9]|1[0-2])\\4(?:1[6-9]|[2-9]\\d)?\\d{2}$"),
    AGE("^[0-9]{1,3}$"),
    HOUSE("^[1-9][0-9]{0,3}([a-zA-Z]|[а-яА-Я]|(/[1-9][0-9]?))?$"),
    APARTMENTS("^[1-9][0-9]{0,3}([a-zA-Z]|[а-яА-Я])?$"),
    YES("(^$)|^[Yy]$"),
    TEL_NUMBER_REQUIRED("^(17|25|29|33|44)[0-9]{7}$"),
    TEL_NUMBER_OPTIONAL("(^$)|(^(17|25|29|33|44)[0-9]{7}$)"),
    EMAIL("(^$)|(^[_A-Za-z0-9-+]+(\\.[_A-Za-z0-9-]+)*@[A-Za-z0-9-]+(\\.[A-Za-z0-9]+)*(\\.[A-Za-z]{2,})$)"),
    ACCOUNT_NUMBER("\\d+");
    private final String regex;

    Regex(String regex)
    {
        this.regex = regex;
    }

    @Override
    public String toString()
    {
        return regex;
    }
}
